src/Catalogs/Патенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Патенты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Организации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалоговыйОрган</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РегистрацииВНалоговомОргане</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПатента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоКВПД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПродаватьНоменклатуруПустымКодомПоКВПД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПрименениеПатента</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/Патенты/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает признак наличия действующего патента по организации и подразделению на заданную или текущую дату.
//
// Параметры:
//	Организация - СправочникСсылка.Организации - организация;
//	Подразделение - СправочникСсылка.СтруктураПредприятия, Неопределено - подразделение организации;
//	ДатаПроверки - Дата, Неопределено - дата, на которую осуществляется поиск патента.
//
// Возвращаемое значение:
//	Булево - Истина - признак, что есть действующий патент.
//
Функция ЕстьДействующийПатент(Организация, Подразделение = Неопределено, Знач ДатаПроверки = Неопределено) Экспорт
	
	ДатаПроверки = ?(НЕ ЗначениеЗаполнено(ДатаПроверки), ТекущаяДатаСеанса(), ДатаПроверки);
	Возврат НЕ ПолучитьПатентыПоОрганизации(Организация, Подразделение, ДатаПроверки).Количество() = 0;
	
КонецФункции

// Возвращает действующие патенты по организации и подразделению на заданную или текущую дату.
//
// Параметры:
//	Организация - СправочникСсылка.Организации - организация;
//	Подразделение - СправочникСсылка.СтруктураПредприятия, Неопределено - подразделение организации;
//	ДатаПроверки - Дата, Неопределено - дата, на которую осуществляется поиск патента.
//
// Возвращаемое значение:
//	Массив - СправочникСсылка.Патенты - список действующих патентов.
//
Функция ПолучитьДействующиеПатентыНаДату(Организация, Подразделение = Неопределено, Знач ДатаПроверки = Неопределено) Экспорт
	
	ДатаПроверки = ?(НЕ ЗначениеЗаполнено(ДатаПроверки), ТекущаяДатаСеанса(), ДатаПроверки);
	
	Возврат ПолучитьПатентыПоОрганизации(Организация, Подразделение, ДатаПроверки);
	
КонецФункции

// Возвращает все действующие патенты по организации и подразделению или действующие на определенную дату.
//
// Параметры:
//	Организация - СправочникСсылка.Организации - организация;
//	Подразделение - СправочникСсылка.СтруктураПредприятия, Неопределено - подразделение организации;
//	ДатаПроверки - Дата, Неопределено - дата, на которую осуществляется поиск патента.
//
// Возвращаемое значение:
//	Массив - СправочникСсылка.Патенты - список действующих патентов.
//
Функция ПолучитьПатентыПоОрганизации(Организация, Подразделение = Неопределено, Знач ДатаПроверки = Неопределено) Экспорт
	
	МассивПатентов = Новый Массив();
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если НастройкиНалоговУчетныхПолитикЛокализация.ОрганизацияПрименяетПатенты(Организация) Тогда
		
		ОбиратьВсеПатенты = ?(ЗначениеЗаполнено(ДатаПроверки), Ложь, Истина);
		ДатаПроверки = ?(НЕ ЗначениеЗаполнено(ДатаПроверки), ТекущаяДатаСеанса(), ДатаПроверки);
		НеПроверятьПодразделение = Ложь;
		
		СписокПодразделений = Новый Массив();
			
		Если ЗначениеЗаполнено(Подразделение) Тогда
			
			СписокПодразделений = ПолучитьМассивВышестоящихПодразделений(Подразделение);
			
		Иначе
			
			НеПроверятьПодразделение = Истина;
			
		КонецЕсли;
		
		Запрос = Новый Запрос();
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ
		|	Патенты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Патенты КАК Патенты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Патенты.ПрименениеПатента КАК ПатентыПрименениеПатента
		|		ПО (ПатентыПрименениеПатента.Ссылка = Патенты.Ссылка)
		|ГДЕ
		|	Патенты.Владелец = &Организация
		|	И НЕ Патенты.ПометкаУдаления
		|	И ((Патенты.ДатаНачала <= &КонецДняДокумента
		|		И Патенты.ДатаОкончания >= &НачалоДняДокумента)
		|			ИЛИ &ОбиратьВсеПатенты)
		|	И (ПатентыПрименениеПатента.Подразделение В (&СписокПодразделений)
		|			ИЛИ ПатентыПрименениеПатента.Ссылка ЕСТЬ NULL ИЛИ &НеПроверятьПодразделение)";
		
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("СписокПодразделений", СписокПодразделений);
		Запрос.УстановитьПараметр("НачалоДняДокумента", НачалоДня(ДатаПроверки));
		Запрос.УстановитьПараметр("КонецДняДокумента", КонецДня(ДатаПроверки));
		Запрос.УстановитьПараметр("ОбиратьВсеПатенты", ОбиратьВсеПатенты);
		Запрос.УстановитьПараметр("НеПроверятьПодразделение", НеПроверятьПодразделение);
		МассивПатентов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	КонецЕсли;
	
	Возврат МассивПатентов;
	
КонецФункции

// Формирует массив из вышестоящих структурных подразделений.
//
// Параметры:
//  СтруктурноеПодразделение - СправочникСсылка.СтруктураПредприятия
//
// Возвращаемое значение:
//  Массив Из СправочникСсылка.СтруктураПредприятия
//
Функция ПолучитьМассивВышестоящихПодразделений(СтруктурноеПодразделение) Экспорт
	СписокПодразделений = Новый Массив;
	
	ВышестоящееПодразделение = СтруктурноеПодразделение;
	Пока ЗначениеЗаполнено(ВышестоящееПодразделение) Цикл
		СписокПодразделений.Добавить(ВышестоящееПодразделение);
		ВышестоящееПодразделение = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВышестоящееПодразделение, "Родитель");
	КонецЦикла;
	
	Возврат СписокПодразделений;
КонецФункции

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Владелец)";
КонецПроцедуры

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// Включает/отключает использование подсистемы "Свойства" для справочника.
//
Процедура НастроитьИспользованиеСвойств() Экспорт
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИСТИНА
		|ИЗ
		|	Справочник.Патенты КАК Патенты
		|ГДЕ
		|	НЕ Патенты.ПометкаУдаления");
		
	ПараметрыНабора = УправлениеСвойствами.СтруктураПараметровНабораСвойств();
	ПараметрыНабора.Используется = НЕ Запрос.Выполнить().Пустой();
	
	УправлениеСвойствами.УстановитьПараметрыНабораСвойств("Справочник_Патенты", ПараметрыНабора);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли

#Область ОбработчикиСобытий

#КонецОбласти

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - см. УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
